/=#
#include "VFR.uni"

#string AAEON_DEVICE_DETEC                  #language eng "Device detecting configuration"
#string STR_SENTRY_ROBOT_1_FORM             #language eng "Device #1 detecting configuration"
#string STR_SENTRY_ROBOT_2_FORM             #language eng "Device #2 detecting configuration"
#string STR_SENTRY_ROBOT_3_FORM             #language eng "Device #3 detecting configuration"
#string STR_SENTRY_ROBOT_4_FORM             #language eng "Device #4 detecting configuration"
#string STR_SENTRY_ROBOT_5_FORM             #language eng "Device #5 detecting configuration"

#string STR_SENTRY_ACTION_TIME              #language eng "  At time"
#string STR_SENTRY_ACTION_TIME_HELP         #language eng "Select robot action time:\nAfter show logo -\nRobot will do actoin after logo is displayed. System devices are almost ready.\nBefore show logo -\nRobot will do action earlier before logo, but some devices may not be ready."
#string STR_BEFORE_LOGO                     #language eng "Before show logo"
#string STR_AFTER_LOGO                      #language eng "After show logo"

#string STR_SENTRY_ROBOT_STR1               #language eng "Robot detects device with"
#string STR_SENTRY_ROBOT_STR2               #language eng "Expecting"
#string STR_SENTRY_ROBOT_STR3               #language eng "If any device is detected in unexpected"
#string STR_SENTRY_ROBOT_STR4               #language eng "condition, the robot will do following"
#string STR_SENTRY_ROBOT_TYPE               #language eng "  Interface"

#string STR_SENTRY_ROBOT_TYPE_HELP          #language eng "Select interface robot should use to communicate with device"
#string STR_WATCH_PCI                       #language eng "PCI"
#string STR_WATCH_DIO                       #language eng "DIO"
#string STR_WATCH_SMBUS                     #language eng "SMBUS"
#string STR_WATCH_LEGACY_IO                 #language eng "Legacy I/O"
#string STR_WATCH_SUPER_IO                  #language eng "Super I/O"
#string STR_WATCH_MMIO                      #language eng "MMIO"
#string STR_SENTRY_DIO_NUM                  #language eng "  DIO pin number"
#string STR_SENTRY_DIO_NUM_HELP             #language eng "Fill DIO pin number.\n0 - DIO0\n1 - DIO1\n... and so on.\n\nFor COM express product:\0-3 - GPI0-3\n4-7 - GPO0-3"
#string STR_SENTRY_IO_ADDR                  #language eng "  I/O Address"
#string STR_SENTRY_IO_ADDR_HELP             #language eng "Fill I/O address device is responding to.\nRange:\n  0~FFFF"
#string STR_SENTRY_IO_LDN                   #language eng "  Super I/O LDN"
#string STR_SENTRY_IO_LDN_HELP              #language eng "Fill LDN number to a Super I/O device.\nRange:\n  0~FF"
#string STR_SENTRY_MMIO_ADDR                #language eng "  MMIO Address"
#string STR_SENTRY_MMIO_ADDR_HELP           #language eng "Fill Memory Mapped I/O address device is responding to.\nRange:\n  0~FFFFFFFF"

#string STR_SENTRY_IN_CONDITION             #language eng "  In condition"
#string STR_SENTRY_IN_CONDITION_HELP        #language eng "Select the condition that robot should check for device.\nPresent - device is detected\nAccording to register - Robot read register according to configuration.\n\nNote: Device will be considered 'Present' by Robot, when data read from device is not 0xFF."
#string STR_PRESENT                         #language eng "Present"
#string STR_NOT_PRESENT                     #language eng "Not Present"
#string STR_ACCORDING_TO_REG                #language eng "Specified register data"
#string STR_SENTRY_ADD_CONDITUON            #language eng "  Register data is"
#string STR_SENTRY_ADD_CONDITUON_HELP       #language eng "Select how robot should compare data read from register, to a value configured below."
#string STR_BIT_EQUAL                       #language eng "bitwise equal to"
#string STR_BYTE_EQUAL                      #language eng "bytewise equal to"
#string STR_LESSER_EQUAL                    #language eng "bytewise lesser than"
#string STR_LARGER_EQUAL                    #language eng "bytewise larger than"
#string STR_SENTRY_ADD_CONDITUON_STRING     #language eng "No addvanced option, use 'Present' instead"
#string STR_SENTRY_REG_OFFSET               #language eng "  Register offset"
#string STR_SENTRY_REG_OFFSET_HELP          #language eng "Fill register offset (or index) for robot to read, in hexadecimal.\nRange:\n  0 - FF"
#string STR_SENTRY_BYTE_VALUE               #language eng "  Byte value"
#string STR_SENTRY_BYTE_VALUE_HELP          #language eng "Fill a byte value for robot to compare register data with, in hexadecimal.\nRange:\n  0 - FF"
#string STR_SENTRY_BIT_OFFSET               #language eng "  Bit offset"
#string STR_SENTRY_BIT_OFFSET_HELP          #language eng "Fill bit offset for register, for robot to compare with bit value."
#string STR_SENTRY_BIT_VALUE                #language eng "  Bit value"
#string STR_SENTRY_BIT_VALUE_HELP           #language eng "Fill bit value for robot to compare register-bit with specified offset."
#string STR_SENTRY_DIO_LEVEL                #language eng "  In High/Low level"
#string STR_SENTRY_DIO_LEVEL_HELP           #language eng "Select High/Low level of the DIO pin that robot should do action."
#string STR_HIGH                            #language eng "High"
#string STR_LOW                             #language eng "Low"

#string STR_SENTRY_ACTION                   #language eng "  Action"
#string STR_SENTRY_ACTION_HELP              #language eng "Select action that robot should do."
#string STR_RESET_SYS                       #language eng "Reset System"
#string STR_SENTRY_RESET_TYPE               #language eng "  Soft or hard reset"
#string STR_SENTRY_RESET_TYPE_HELP          #language eng "Select reset type robot should send on each boot."
#string STR_RESET_SOFT                      #language eng "Soft"
#string STR_RESET_HARD                      #language eng "Hard"
#string STR_SENTRY_RETRY_COUNT              #language eng "  Retry-Count"
#string STR_SENTRY_RETRY_COUNT_HELP         #language eng "Fill retry counter here. Robot will reset system at most counter times, and then let system countiue its POST."
#string STR_HOLD_SYS                        #language eng "Hold System"
#string STR_SENTRY_HOLD_TIME                #language eng "  Holding time out (second)"
#string STR_SENTRY_HOLD_TIME_HELP           #language eng "Fill hold time out here. Robot will hold system no longer then time-out value, and then let system continue its POST."

#string STR_SENTRY_CHECK_BUS                #language eng "  BUS"
#string STR_SENTRY_CHECK_BUS_HELP           #language eng "Fill BUS number to a PCI device, in hexadecimal.\nRange:\n  0 - FF"
#string STR_SENTRY_CHECK_DEV                #language eng "  Device"
#string STR_SENTRY_CHECK_DEV_HELP           #language eng "Fill DEVICE number to a PCI device, in hexadecimal.\nRange:\n  0 - FF"
#string STR_SENTRY_CHECK_FUN                #language eng "  Function"
#string STR_SENTRY_CHECK_FUN_HELP           #language eng "Fill FUNCTION number to a PCI device, in hexadecimal.\nRange:\n  0 - FF"

#string STR_SENTRY_SLAVE_ADDR               #language eng "  SMBUS Slave Address"
#string STR_SENTRY_SLAVE_ADDR_HELP          #language eng "Fill slave address to a SMBUS device, in hexadecimal.\nRange:\n  0 - FF"

#string STR_SENTRY_REVERT_ACTION_HELP       #language eng "Select that robot should or should not do action if condition met."
#string STR_SENTRY_REVERT_ACTION            #language eng "  Device"
#string STR_IS                              #language eng "is"
#string STR_IS_NOT                          #language eng "is not"